from settings import *


last_msg = ('Вітаємо! Реєстрація завершилась і тепер час надсилати подарунки!🎁🎁'
            '\n\nВсі учасники були розподілені на пари Учасник - Таємний Санта. Ви даруєте комусь - хтось дарує Вам.'
            '\n\nВажливо! Ваш Таємний Санта і учасник, якому Ви маєте надіслати подарунок - різні люди.'
            f' Дані Таємних Сант будуть розкриті будуть розкриті {end_gift_date} для учасників, яким вони мають'
            f' подарувати дарунки. Просимо відправити подарунку до вищезазначеної дати. \n\nДані учасника, для'
            f' якого ви є Таємним Сантою:\n')

start_cmd_message = ('Вітаємо у боті Таємного Санти! Перш ніж почати реєстрацію ознайомся з правилами та'
                     ' політикою конфіденційності нашого боту.'
                     '\n\nПравила: [посилання на правила]'
                     '\nПолітика конфіденційності: [посилання]'
                     '\n\nНатискаючу кнопку "Погоджуюсь" Ви зазначаєте, що ознайомились і погоджуєтесь'
                     'з вищезазначеними правилами і політикою конфіденційності даного боту.')

registration_msg = ('Почнемо реєстрацію! Ми будемо просити Вас ввести певні дані, просимо вводити коректні і правдиві'
                    ' дані, оскількі вони потрібні для того, щоб інша людина змогла відправити Вам подарунок поштою.'
                    '\nВсі дані можна буде переглянути і змінити в кінці реєстрації')

pib_reg_msg = "Введіть Ваш ПІБ (Прізвище Ім'я По-батькові)"
phone_number_req_msg = ("Введіть Ваш номер телефону. Номер повинен бути виключно український.\n\n"
                        "Приклад вводу: 380123456789")
nv_poshta_address_reg_msg = "Введіть адресу відділення Нової Пошти або поштомату поблизу Вас"
ukrposhta_index_reg_msg = "Введіть індекс (5 цифр) відділення Укрпошти поблизу Вас"
wishes_msg = 'Напишіть короткий список бажань (100 символів)'
confirmation_reg_msg = ("Нижче наведені дані, які Ви ввели. Щоб підтвердити дані, введіть \"Так\", щоб відмовитися"
                        " від реєстрації і почати спочатку, введіть \"Ні\".")

negative_confirmation_msg = ('Реєстрацію відмінено, Ваші дані не збережено. Щоб почати реєстрацію спочатку, натисніть'
                             ' /start')
positive_confirmation_msg = 'Реєстрація завершена успішно, Ваші дані збережені'
cancel_cmd_msg = ('Реєстрацію відмінено, Ваші дані не збережено. Щоб почати реєстрацію спочатку, натисніть'
                  ' /start')

cancel_reg_cmd_msg = ("Ви певні, що хочете відмінити свою участь у Таємному Санті?\n\n"
                      "Натисність Так, щоб покинути гру, або Ні, щоб не виходити.")

all_msg_after_reg = ("Реєстрація вже завершена. Всі зареєстровані учасники були розподілені між собою. "
                     "Всім учасникам було розіслано дані людей, яким вони мають надіслати подарунок."
                     "\n\nЯкщо Ви не отримали інструкції, зверніться до боту підтримки: @secret_santa_sup_bot")
